In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame({'EmployeeID':[101,102,103,104,105],'Name':['Alice','Bob','Charlie','David','Eva'],'Department':['HR','IT','Finance','IT','HR'],'Salary':[50000,60000,55000,65000,58000]})

In [11]:
res=df[df['Department']=='IT']['Salary'].mean()

In [12]:
res

62500.0

In [4]:
df[['Name','Salary']]

      Name  Salary
0    Alice   50000
1      Bob   60000
2  Charlie   55000
3    David   65000
4      Eva   58000

In [8]:
df['Bonus'] = df['Salary']*0.10

In [9]:
df

   EmployeeID     Name Department  Salary   Bonus
0         101    Alice         HR   50000  5000.0
1         102      Bob         IT   60000  6000.0
2         103  Charlie    Finance   55000  5500.0
3         104    David         IT   65000  6500.0
4         105      Eva         HR   58000  5800.0

In [10]:
df.rename(columns={'EmployeeID':'ID'})

    ID     Name Department  Salary   Bonus
0  101    Alice         HR   50000  5000.0
1  102      Bob         IT   60000  6000.0
2  103  Charlie    Finance   55000  5500.0
3  104    David         IT   65000  6500.0
4  105      Eva         HR   58000  5800.0